[
  {
    "name": "React",
    "category": "Frontend",
    "description": "React is a JavaScript library for building user interfaces. It allows developers to create large web applications that can change data, without reloading the page.",
    "color": "#61dbfb",
    "icon": "fa-brands fa-react"
  },
  {
    "name": "JavaScript",
    "category": "Frontend",
    "description": "JavaScript is a high-level, interpreted programming language that is used to make web pages interactive and provide online programs, such as video games.",
    "color": "#f0db4f",
    "icon": "fa-brands fa-square-js"
  },
  {
    "name": "Node.js",
    "category": "Backend",
    "description": "Node.js is an open-source, cross-platform, JavaScript runtime environment that executes JavaScript code outside of a browser.",
    "color": "#3c873a",
    "icon": "fa-brands fa-node"
  },
  {
    "name": "Express",
    "category": "Backend",
    "description": "Express is a minimal and flexible Node.js web application framework that provides a robust set of features for web and mobile applications.",
    "color": "#3c873a",
    "icon": "fa-brands fa-node-js"
  },
  {
    "name": "MongoDB",
    "category": "Backend",
    "description": "MongoDB is a cross-platform document-oriented database program. Classified as a NoSQL database program, MongoDB uses JSON-like documents with optional schemas.",
    "color": "#3c873a",
    "icon": "fas fa-database"
  },
  {
    "name": "Mongoose",
    "category": "Backend",
    "description": "Mongoose is an Object Data Modeling (ODM) library for MongoDB and Node.js. It manages relationships between data, provides schema validation, and is used to translate between objects in code and the representation of those objects in MongoDB.",
    "color": "#3c873a",
    "icon": "fa-brands fa-node-js"
  },
  {
    "name": "Redux",
    "category": "Frontend",
    "description": "Redux is an open-source JavaScript library for managing application state. It is most commonly used with libraries such as React or Angular for building user interfaces.",
    "color": "#764abc",
    "icon": "fa-brands fa-react"
  },
  {
    "name": "React Native",
    "category": "Mobile",
    "description": "React Native is an open-source mobile application framework created by Facebook. It is used to develop applications for Android, iOS, Web and UWP by enabling developers to use React along with native platform capabilities.",
    "color": "#87ff5f",
    "icon": "fa-brands fa-react"
  },
  {
    "name": "Expo",
    "category": "Mobile",
    "description": "Expo is an open-source platform for making universal native apps for Android, iOS, and the web with JavaScript and React.",
    "color": "#fff",
    "icon": "fa-brands fa-android"
  },
  {
    "name": "Native Tailwind",
    "category": "Mobile",
    "description": "Native Tailwind is a React Native library that allows you to use Tailwind CSS in your React Native projects.",
    "color": "#06b6d4",
    "icon": "fa-solid fa-brush"
  },
  {
    "name": "NPM",
    "category": "Tools",
    "description": "npm, short for Node Package Manager, is a widely used package manager for the JavaScript programming language. It serves as a central repository for open-source JavaScript tools and libraries, allowing developers to easily discover, share, and reuse code. ",
    "color": "#eb0033",
    "icon": "fa-brands fa-npm"
  },
  {
    "name": "Git",
    "category": "Tools",
    "description": "Git is a distributed version control system that is widely used for tracking changes in source code during software development. It allows multiple developers to collaborate on a project while keeping track of each change made to the codebase.",
    "color": "#ff3525",
    "icon": "fa-brands fa-git-alt"
  },
  {
    "name": "Adobe Photoshop",
    "category": "Tools",
    "description": "Adobe Photoshop is a raster graphics editor developed and published by Adobe Inc. for Windows and macOS. It was originally created in 1988 by Thomas and John Knoll. Since then, the software has become the industry standard not only in raster graphics editing, but in digital art as a whole.",
    "color": "#00c8ff",
    "icon": "fa-regular fa-image"
  },
  {
    "name": "CSS 3",
    "category": "Frontend",
    "description": "CSS3 is the latest evolution of the Cascading Style Sheets language. It brings a lot of long-awaited novelties, like rounded corners, shadows, gradients, transitions, animations, and more.",
    "color": "#3d58cf",
    "icon": "fa-brands fa-css3-alt"
  },
  {
    "name": "HTML 5",
    "category": "Frontend",
    "description": "HTML5 is the latest version of Hypertext Markup Language, the code that describes web pages. It's a significant update to the previous version, incorporating new features, including video playback and drag-and-drop capabilities.",
    "color": "#ff6007",
    "icon": "fa-brands fa-html5"
  },
  {
    "name": "Bootstrap",
    "category": "Frontend",
    "description": "Bootstrap is a free and open-source CSS framework directed at responsive, mobile-first front-end web development. It contains CSS- and JavaScript-based design templates for typography, forms, buttons, navigation, and other interface components.",
    "color": "#c000ff",
    "icon": "fa-brands fa-bootstrap"
  },
  {
    "name": "Tailwind CSS",
    "category": "Frontend",
    "description": "Tailwind CSS is a utility-first CSS framework for rapidly building custom user interfaces. It is a highly customizable, low-level CSS framework that gives you all of the building blocks you need to build bespoke designs without any annoying opinionated styles you have to fight to override.",
    "color": "#06b6d4",
    "icon": "fa-solid fa-brush"
  },
  {
    "name": "Sass",
    "category": "Frontend",
    "description": "Sass is a preprocessor scripting language that is interpreted or compiled into Cascading Style Sheets. SassScript is the scripting language itself. Sass consists of two syntaxes. The original syntax, called 'the indented syntax', uses a syntax similar to Haml.",
    "color": "#c69",
    "icon": "fa-brands fa-sass"
  },
  {
    "name": "Heroku",
    "category": "Tools",
    "description": "Heroku is a cloud platform as a service supporting several programming languages. One of the first cloud platforms, Heroku has been in development since June 2007, when it supported only the Ruby programming language, but now supports Java, Node.js, Scala, Clojure, Python, PHP, and Go.",
    "color": "#79589f",
    "icon": "fa-solid fa-cloud"
  },
  {
    "name": "Figma",
    "category": "Tools",
    "description": "Figma is a cloud-based design tool that is similar to Sketch in functionality and features, but with big differences that make Figma better for team collaboration. It allows for design, prototyping, and code-generation all in one place, making it a one-stop-shop for product teams.",
    "color": "#F24E1E",
    "icon": "fa-solid fa-drafting-compass"
  },
  {
    "name": "Canva",
    "category": "Tools",
    "description": "Canva is a graphic design platform that allows users to create social media graphics, presentations, posters and other visual content. It is available on web and mobile, and integrates millions of images, fonts, templates and illustrations.",
    "color": "#00c4cc",
    "icon": "fa-solid fa-paint-brush"
  },
  {
    "name": "Postman",
    "category": "Tools",
    "description": "Postman is a collaboration platform for API development. Postman's features simplify each step of building an API and streamline collaboration so you can create better APIs—faster.",
    "color": "#ff6c37",
    "icon": "fa-solid fa-paper-plane"
  },
  {
    "name": "Jupyter Notebook",
    "category": "Tools",
    "description": "The Jupyter Notebook is an open-source web application that allows you to create and share documents that contain live code, equations, visualizations and narrative text.",
    "color": "#f37821",
    "icon": "fa-brands fa-python"
  }
]
